xuyoulai/Tidm-02012/src_board/hal_dclinkss.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --board "/boards/TMDSCNCD2800157" --context "system" --product "C2000WARE@5.02.00.00"
 * @versions {"tool":"1.15.0+2826"}
 */

/**
 * Import the modules used in this configuration.
 */
const adc        = scripting.addModule("/driverlib/adc.js");
const adc1       = adc.addInstance();
const adc2       = adc.addInstance();
const analog     = scripting.addModule("/driverlib/analog.js", {}, false);
const analog1    = analog.addInstance();
const asysctl    = scripting.addModule("/driverlib/asysctl.js");
const led        = scripting.addModule("/driverlib/board_components/led", {}, false);
const led1       = led.addInstance();
const cmpss      = scripting.addModule("/driverlib/cmpss.js", {}, false);
const cmpss1     = cmpss.addInstance();
const cputimer   = scripting.addModule("/driverlib/cputimer.js", {}, false);
const cputimer1  = cputimer.addInstance();
const epwm       = scripting.addModule("/driverlib/epwm.js", {}, false);
const epwm1      = epwm.addInstance();
const epwm2      = epwm.addInstance();
const epwm3      = epwm.addInstance();
const epwmxbar   = scripting.addModule("/driverlib/epwmxbar.js", {}, false);
const epwmxbar1  = epwmxbar.addInstance();
const gpio       = scripting.addModule("/driverlib/gpio.js", {}, false);
const gpio1      = gpio.addInstance();
const gpio2      = gpio.addInstance();
const gpio3      = gpio.addInstance();
const inputxbar  = scripting.addModule("/driverlib/inputxbar.js", {}, false);
const inputxbar1 = inputxbar.addInstance();
const mcan       = scripting.addModule("/driverlib/mcan.js", {}, false);
const mcan1      = mcan.addInstance();
const spi        = scripting.addModule("/driverlib/spi.js", {}, false);
const spi1       = spi.addInstance();
const sysctl     = scripting.addModule("/driverlib/sysctl.js");

/**
 * Write custom configuration values to the imported modules.
 */
adc1.soc1Trigger              = "ADC_TRIGGER_EPWM1_SOCA";
adc1.$name                    = "MTR1_ADCA";
adc1.soc0Trigger              = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc1SampleWindow         = 20;
adc1.enabledInts              = ["ADC_INT_NUMBER1"];
adc1.enableInterrupt1         = true;
adc1.registerInterrupts       = ["1"];
adc1.socHighPriorityMode      = "ADC_PRI_THRU_SOC1_HIPRI";
adc1.soc1IndependentNameMode  = true;
adc1.soc2IndependentNameMode  = true;
adc1.ppb1IndependentNameMode  = true;
adc1.soc0IndependentNameMode  = true;
adc1.adcClockPrescaler        = "ADC_CLK_DIV_2_0";
adc1.soc0SampleWindow         = 20;
adc1.enabledSOCs              = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3","ADC_SOC_NUMBER4","ADC_SOC_NUMBER5"];
adc1.soc3Name                 = "MTR1_IDC2_SOC";
adc1.soc3Channel              = "ADC_CH_ADCIN6";
adc1.soc4Name                 = "MTR1_IDC3_SOC";
adc1.soc4IndependentNameMode  = true;
adc1.soc3IndependentNameMode  = true;
adc1.soc4Channel              = "ADC_CH_ADCIN6";
adc1.soc5Name                 = "MTR1_IDC4_SOC";
adc1.soc5Channel              = "ADC_CH_ADCIN6";
adc1.soc5IndependentNameMode  = true;
adc1.enabledPPBs              = ["ADC_PPB_NUMBER1","ADC_PPB_NUMBER2","ADC_PPB_NUMBER3","ADC_PPB_NUMBER4"];
adc1.ppb1Name                 = "MTR1_IDC1_PPB";
adc1.ppb2Name                 = "MTR1_IDC2_PPB";
adc1.ppb2SOCNumber            = "ADC_SOC_NUMBER3";
adc1.ppb3Name                 = "MTR1_IDC3_PPB";
adc1.ppb3SOCNumber            = "ADC_SOC_NUMBER4";
adc1.ppb4SOCNumber            = "ADC_SOC_NUMBER5";
adc1.soc0Name                 = "MTR1_VU_SOC";
adc1.soc0Channel              = "ADC_CH_ADCIN3";
adc1.soc1Name                 = "MTR1_VDC_SOC";
adc1.soc2Name                 = "MTR1_IDC1_SOC";
adc1.soc1Channel              = "ADC_CH_ADCIN8";
adc1.soc2Channel              = "ADC_CH_ADCIN6";
adc1.soc2Trigger              = "ADC_TRIGGER_EPWM2_SOCA";
adc1.soc3Trigger              = "ADC_TRIGGER_EPWM2_SOCB";
adc1.soc4Trigger              = "ADC_TRIGGER_EPWM3_SOCA";
adc1.soc5Trigger              = "ADC_TRIGGER_EPWM3_SOCB";
adc1.ppb4Name                 = "MTR1_IDC4_PPB";
adc1.ppb4IndependentNameMode  = true;
adc1.ppb3IndependentNameMode  = true;
adc1.ppb2IndependentNameMode  = true;
adc1.ppb1SOCNumber            = "ADC_SOC_NUMBER2";
adc1.interrupt1SOCSource      = "ADC_SOC_NUMBER1";
adc1.soc2SampleWindow         = 14;
adc1.soc3SampleWindow         = 14;
adc1.soc4SampleWindow         = 14;
adc1.soc5SampleWindow         = 14;
adc1.adcInt1.enableInterrupt  = true;
adc1.adcInt1.interruptHandler = "motor1CtrlISR";

adc2.socHighPriorityMode     = "ADC_PRI_THRU_SOC1_HIPRI";
adc2.soc0IndependentNameMode = true;
adc2.soc1IndependentNameMode = true;
adc2.ppb1IndependentNameMode = true;
adc2.adcClockPrescaler       = "ADC_CLK_DIV_2_0";
adc2.soc1Trigger             = "ADC_TRIGGER_EPWM2_SOCA";
adc2.soc0SampleWindow        = 20;
adc2.soc0Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc2.adcBase                 = "ADCC_BASE";
adc2.$name                   = "MTR1_ADCC";
adc2.soc0Name                = "MTR1_VV_SOC";
adc2.soc0Channel             = "ADC_CH_ADCIN6";
adc2.soc1Name                = "MTR1_VW_SOC";
adc2.soc1SampleWindow        = 20;
adc2.enabledSOCs             = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1"];
adc2.soc1Channel             = "ADC_CH_ADCIN2";

asysctl.analogReference         = "INTERNAL";
asysctl.analogReferenceVoltage  = "1P65";
asysctl.enableTemperatureSensor = true;

led1.$name                  = "LED2";
led1.$hardware              = system.deviceData.board.components.D2;
led1.gpio.writeInitialValue = true;
led1.gpio.initialValue      = 1;
led1.gpio.$name             = "GPIO_LED2";
led1.gpio.gpioPin.$assign   = "hsecDigital.96";

cmpss1.enableModule        = true;
cmpss1.initFilterLow       = true;
cmpss1.clearFilterLatchLow = true;
cmpss1.samplePrescaleLow   = 32;
cmpss1.sampleWindowLow     = 32;
cmpss1.thresholdLow        = 30;
cmpss1.highCTRIPOUT        = "CMPSS_TRIPOUT_FILTER";
cmpss1.highCTRIP           = "CMPSS_TRIP_FILTER";
cmpss1.lowCTRIPOUT         = "CMPSS_TRIPOUT_FILTER";
cmpss1.lowCTRIP            = "CMPSS_TRIP_FILTER";
cmpss1.hysteresisVal       = "1";
cmpss1.$name               = "MTR1_CMPSS_IDC";
cmpss1.samplePrescaleHigh  = 32;
cmpss1.sampleWindowHigh    = 32;
cmpss1.thresholdHigh       = 30;
cmpss1.initFilterHigh      = true;
cmpss1.useRampValShdw      = "false";
cmpss1.asysCMPHPMXSELValue = "2";
cmpss1.asysCMPHNMXSELValue = "0";
cmpss1.asysCMPLPMXSELValue = "2";
cmpss1.asysCMPLNMXSELValue = "0";
cmpss1.dacValLow           = 3500;
cmpss1.highCompInvert      = true;
cmpss1.dacValHigh          = 512;

adc1.analog                                   = analog1;
adc2.analog                                   = analog1;
analog1.useCase                               = "CUSTOM";
analog1.$name                                 = "MOTOR_FEEDBACK";
cmpss1.analog                                 = analog1;
analog1.useInterfacePins                      = ["A0/C15/CMP1_DACL","A15/C7","A3/C5, GPIO242","A5/C2","A6, GPIO228","A8/C11","C6, GPIO226"];
analog1.analog.$assign                        = "ANALOG";
analog1.analog["a0/c15/cmp1_daclPin"].$assign = "hsecAnalog.9";
analog1.analog["a15/c7Pin"].$assign           = "hsecAnalog.18";
analog1.analog["a3/c5, gpio242Pin"].$assign   = "hsecAnalog.17";
analog1.analog["a5/c2Pin"].$assign            = "hsecAnalog.23";
analog1.analog["a6, gpio228Pin"].$assign      = "hsecAnalog.25";
analog1.analog["a8/c11Pin"].$assign           = "hsecAnalog.30";
analog1.analog["c6, gpio226Pin"].$assign      = "hsecAnalog.20";

cputimer1.timerPeriod   = 120000;
cputimer1.startTimer    = true;
cputimer1.emulationMode = "CPUTIMER_EMULATIONMODE_RUNFREE";
cputimer1.$name         = "TIMEBASE_TIMER";

